export const FATIGUE_TITLE = "Хроническое утомление";
export const FATIGUE_INTRO = "Хроническое утомление – это пограничное функциональное состояние " +
    "организма, при котором к началу очередного трудового цикла сохраняются субъективные и " +
    "объективные признаки утомления от предыдущей работы, для ликвидации которых необходим дополнительный отдых."

export const FATIGUE_BODY = 
    "Прочитайте внимательно каждое из приведенных ниже утверждений и соотнесите его с тем, как Вы себя обычно " +
    "чувствуете в течение последних нескольких месяцев. Если оно совпадает с типичными для Вас ощущениями – " +
    "выберите ответ «Да», в противном случае – выберите ответ «Нет». Если Вы затрудняетесь в выборе ответа, " +
    "выберите ответ «Затрудняюсь ответить».";
