import {BURNOUT_OPTIONS} from "./Options";

export const BURNOUT_QUESTIONS: Question[] = [
    {
        id: 0,
        text:
            "Я чувствую себя эмоционально опустошенным (уставшим) человеком",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 1,
        text: "В конце рабочего дня я чувствую себя как «выжатый лимон»",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 2,
        text:
            "В рабочие дни по утрам у меня плохое настроение, я считаю дни и часы до выходных",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 3,
        text: "Я доволен (довольна) результатами моей работы",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 4,
        text:
            "Меня утомляют люди, с  которыми я работаю (подчиненные,клиенты, реципиенты), я стремлюсь свести время общения с ними до минимума",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 5,
        text:
            "Я чувствую в себе большой заряд бодрости, эмоциональной и творческой энергии на работе и после нее",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 6,
        text:
            "Я умею находить правильные решения в  трудных или конфликтных ситуациях на работе и вне ее",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 7,
        text:
            "Я чувствую потерю интереса и апатию по отношению к моей работе",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 8,
        text: "Я умею внести «искру» (творчество) в свою работу",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 9,
        text:
            "В последнее время я стал(а) более черствым(вой), бесчувственным(ой) в межличностных отношениях с реципиентами (подчиненными, клиентами, коллегами и др.)",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 10,
        text:
            "Люди, с  которыми мне приходится работать, не интересны для меня",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 11,
        text:
            "Я работаю с  удовольствием, имею много целей и  планов в моей деятельности. Я верю в их осуществление",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 12,
        text:
            "Я испытываю все больше разочарований в моей профессиональной деятельности",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 13,
        text:
            "Я чувствую равнодушие и потерю интереса ко многому, что радовало меня раньше",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 14,
        text:
            "Я чувствую безразличие к  тем, с  кем мне нужно работать (реципиенты, подчиненные, клиенты, ученики и  др.) и  я предпочитаю формальное общение с ними, без лишних эмоций и открытости",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 15,
        text: "Мне хочется уединиться и отдохнуть от всего и всех",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 16,
        text:
            "Я создаю атмосферу доброжелательности, сотрудничества и энтузиазма в рабочем коллективе (команде)",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 17,
        text:
            "Я легко общаюсь на работе со всеми независимо от их амбиций, характера, манеры общения",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 18,
        text:
            "Я доволен(на) моими жизненными и  профессиональными успехами",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 19,
        text: "Я чувствую себя на пределе возможностей.",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 20,
        text: "Я верю, что смогу еще много сделать (достичь) в своей жизни",
        options: BURNOUT_OPTIONS,
    },
    {
        id: 21,
        text:
            "Я проявляю к другим людям больше внимания и заботы, чем получаю в ответ признательности и благодарности",
        options: BURNOUT_OPTIONS,
    },
]
