export const BURNOUT_TITLE = "Профессиональное выгорание";
export const BURNOUT_INTRO = "Тест на профессиональное выгорание - это психологический" +
    " инструмент, который помогает оценить уровень выгорания у человека, работающего " +
    "в условиях повышенной психологической нагрузки.";

export const BURNOUT_BODY = "Вам предлагается 22 утверждения о чувствах и переживаниях," +
    " связанных с работой. Пожалуйста, прочитайте внимательно каждое" +
    " утверждение и решите, бывают ли у вас такие мысли или чувства.";
