import {SPB_OPTIONS} from "./Options";

export const SPB_QUESTIONS: Question[] = [
    {
        id: 0,
        text: "Иметь дело с некоторыми людьми может быть неприятно, но это никогда не бывает ужасно.",
        options: SPB_OPTIONS,
    },
    {
        id: 1,
        text: "Когда я в чем-то ошибаюсь, то часто говорю себе: \"Мне не следовало этого делать\".",
        options: SPB_OPTIONS,
    },
    {
        id: 2,
        text: "Люди, несомненно, должны жить по законам.",
        options: SPB_OPTIONS,
    },
    {
        id: 3,
        text: "Не существует ничего такого, чего я \"не выношу\".",
        options: SPB_OPTIONS,
    },
    {
        id: 4,
        text: "Если меня игнорируют или я чувствую себя неуклюжим на вечеринке, то у меня понижается чувство собственной ценности.",
        options: SPB_OPTIONS,
    },
    {
        id: 5,
        text: "Некоторые ситуации в жизни действительно совершенно ужасны.",
        options: SPB_OPTIONS,
    },
    {
        id: 6,
        text: "В некоторых вопросах я определенно должен быть более компетентным.",
        options: SPB_OPTIONS,
    },
    {
        id: 7,
        text: "Моим родителям следовало бы быть более сдержанными в требованиях, предъявляемых ко мне.",
        options: SPB_OPTIONS,
    },
    {
        id: 8,
        text: "Существуют вещи, которые я не могу вынести.",
        options: SPB_OPTIONS,
    },
    {
        id: 9,
        text: "Мое чувство \"собственной ценности\" не повышается, даже если у меня есть действительно большие успехи в учебе или работе.",
        options: SPB_OPTIONS,
    },
    {
        id: 10,
        text: "Некоторые дети ведут себя действительно ужасно.",
        options: SPB_OPTIONS,
    },
    {
        id: 11,
        text: "Я не должен был совершать несколько очевидных ошибок в моей жизни.",
        options: SPB_OPTIONS,
    },
    {
        id: 12,
        text: "Если мои друзья пообещали сделать для меня что-то очень важное, они не обязаны выполнять своих обещаний.",
        options: SPB_OPTIONS,
    },
    {
        id: 13,
        text: "Я не могу иметь дело с моими друзьями или моими детьми, если они ведут себя глупо, дико или неправильно в той или иной ситуации.",
        options: SPB_OPTIONS,
    },
    {
        id: 14,
        text: "Если оценивать людей по тому, что они делают, то их можно разделить на \"хороших\" и \"плохих\".",
        options: SPB_OPTIONS,
    },
    {
        id: 15,
        text: "Бывают такие периоды в жизни, когда случаются действительно совершенно ужасные вещи.",
        options: SPB_OPTIONS,
    },
    {
        id: 16,
        text: "В жизни нет ничего такого, что я действительно обязан делать.",
        options: SPB_OPTIONS,
    },
    {
        id: 17,
        text: "Дети должны, в конце концов, научиться выполнять свои обязанности.",
        options: SPB_OPTIONS,
    },
    {
        id: 18,
        text: "Иногда я просто не в состоянии вынести мои низкие достижения в учебе и на работе.",
        options: SPB_OPTIONS,
    },
    {
        id: 19,
        text: "Даже когда я делаю серьезные ошибки и причиняю боль окружающим, мое самоуважение не меняется.",
        options: SPB_OPTIONS,
    },
    {
        id: 20,
        text: "Это было бы ужасно, если бы я не смог добиться расположения людей, которых я люблю.",
        options: SPB_OPTIONS,
    },
    {
        id: 21,
        text: "Мне бы хотелось лучше учиться или работать, однако нет никаких оснований считать, что я должен добиваться этого, во что бы то ни стало.",
        options: SPB_OPTIONS,
    },
    {
        id: 22,
        text: "Я убежден, что люди определенно не должны плохо себя вести в общественных местах.",
        options: SPB_OPTIONS,
    },
    {
        id: 23,
        text: "Я просто не выношу сильного давления на меня или стресса.",
        options: SPB_OPTIONS,
    },
    {
        id: 24,
        text: "Одобрение или неодобрение моих друзей или членов моей семьи не влияет на то, как я оцениваю самого себя.",
        options: SPB_OPTIONS,
    },
    {
        id: 25,
        text: "Было бы жалко, но не ужасно, если бы кто-то из членов моей семьи имел бы серьезные проблемы со здоровьем.",
        options: SPB_OPTIONS,
    },
    {
        id: 26,
        text: "Если я принял решение сделать что-то, я обязательно должен сделать это очень хорошо.",
        options: SPB_OPTIONS,
    },
    {
        id: 27,
        text: "В общем, я нормально отношусь к тому, что подростки ведут себя иначе, чем взрослые, например, поздно просыпаются по утрам или разбрасывают книжки или одежду на полу в своей комнате.",
        options: SPB_OPTIONS,
    },
    {
        id: 28,
        text: "Я не выношу некоторых вещей, которые делают мои друзья или члены моей семьи.",
        options: SPB_OPTIONS,
    },
    {
        id: 29,
        text: "Тот, кто постоянно грешит или приносит зло окружающим, - плохой человек.",
        options: SPB_OPTIONS,
    },
    {
        id: 30,
        text: "Было бы ужасно, если бы кто-то из тех, кого я люблю, заболел психическим заболеванием и оказался бы в психиатрической больнице.",
        options: SPB_OPTIONS,
    },
    {
        id: 31,
        text: "Я должен быть абсолютно уверен, что все идет хорошо в наиболее важных сферах моей жизни.",
        options: SPB_OPTIONS,
    },
    {
        id: 32,
        text: "Если для меня это важно, мои друзья должны стремиться сделать все, о чем я их попрошу.",
        options: SPB_OPTIONS,
    },
    {
        id: 33,
        text: "Я легко переношу неприятные ситуации, в которые попадаю, так же как неприятное общение со знакомыми.",
        options: SPB_OPTIONS,
    },
    {
        id: 34,
        text: "От того, как меня оценивают окружающие (друзья, начальники, учителя, преподаватели), зависит, как я оцениваю самого себя.",
        options: SPB_OPTIONS,
    },
    {
        id: 35,
        text: "Это ужасно, когда мои друзья ведут себя плохо и неправильно в общественных местах.",
        options: SPB_OPTIONS,
    },
    {
        id: 36,
        text: "Я точно не должен делать некоторые ошибки, которые я продолжаю делать.",
        options: SPB_OPTIONS,
    },
    {
        id: 37,
        text: "Я не считаю, что члены моей семьи должны действовать именно так, как мне хочется.",
        options: SPB_OPTIONS,
    },
    {
        id: 38,
        text: "Это совершенно невыносимо, когда все идет не так, как мне хочется.",
        options: SPB_OPTIONS,
    },
    {
        id: 39,
        text: "Я часто оцениваю себя по своим успехам на работе и в учебе или же по своим социальным достижениям.",
        options: SPB_OPTIONS,
    },
    {
        id: 40,
        text: "Это будет ужасно, если я потерплю полный крах в работе или учебе.",
        options: SPB_OPTIONS,
    },
    {
        id: 41,
        text: "Я как человек не должен быть лучше, чем я есть на самом деле.",
        options: SPB_OPTIONS,
    },
    {
        id: 42,
        text: "Определенно существуют некоторые вещи, которые окружающие люди не должны делать.",
        options: SPB_OPTIONS,
    },
    {
        id: 43,
        text: "Иногда (на работе или в учебе) люди совершают поступки, которых я совершенно не выношу.",
        options: SPB_OPTIONS,
    },
    {
        id: 44,
        text: "Если у меня возникают серьезные эмоциональные проблемы или я нарушаю законы, мое чувство собственной ценности понижается.",
        options: SPB_OPTIONS,
    },
    {
        id: 45,
        text: "Даже очень плохие, отвратительные ситуации, в которых человек терпит неудачу, лишается денег или работы, не являются ужасными.",
        options: SPB_OPTIONS,
    },
    {
        id: 46,
        text: "Есть несколько существенных причин, почему я не должен делать ошибок в школе или на работе.",
        options: SPB_OPTIONS,
    },
    {
        id: 47,
        text: "Несомненно, что члены моей семьи должны лучше обо мне заботиться, чем они это иногда делают.",
        options: SPB_OPTIONS,
    },
    {
        id: 48,
        text: "Даже если мои друзья ведут себя иначе, чем я от них ожидаю, я продолжаю относиться к ним с пониманием и принятием.",
        options: SPB_OPTIONS,
    },
    {
        id: 49,
        text: "Важно учить детей тому, чтобы они были \"хорошими мальчиками\" и \"хорошими девочками\": прилежно учились в школе и зарабатывали одобрение своих родителей.",
        options: SPB_OPTIONS,
    },
]
