export const SPB_TITLE = "Диагностика иррациональных установок";

export const SPB_INTRO = "Диагностика иррациональных установок (SPB) - это " +
    "психологический тест, который используется для оценки того," +
    "насколько человек склонен к иррациональному мышлению. Тест" +
    "был разработан Альбертом Эллисом, одним из основателей" +
    "рационально-эмоциональной терапии.";

export const SPB_BODY = "У людей бывают разные убеждения. Нас интересует ваше мнение" +
    "относительно утверждений, приведенных ниже. Пожалуйста," +
    "выберите пункт, который наиболее соответствует вашему" +
    "отношению к данному утверждению."

