export const COPING_TITLE = "Способы совладающего поведения";
export const COPING_INTRO = "Данный тест направлен на выявление предпочтений в выборе способов совладающего поведения." +
    "Оцените по шкале, насколько часто Вы применяли данную стратегию поведения" +
    "в трудных ситуациях, с которыми Вы сталкивались.";

export const COPING_BODY = " Вам предлагается 50 утверждения о чувствах и переживаниях," +
    "связанных с тем или иным способом поведения. Пожалуйста, прочитайте внимательно" +
    "каждое утверждение и решите, как часто вы применяете ту или иную стратегию.";
